package com.example.auto;

public class Adapter {

    public static String[] age = {
                "1617182021   0=2.27 1=1.92 2=1.84 3=1.65 4=1.65 5=1.62 6=1.62",
                "222324   0=1.88 1=1.72 2=1.71 3=1.13 4=1.13 5=1.1 6=1.1 7=1.09 8=1.09 9=1.09",
                "2526272829   0=1.72 1=1.6 2=1.54 3=1.09 4=1.09 5=1.08 6=1.08 7=1.07 8=1.07 9=1.07 10=1.02 11=1.02 12=1.02 13=1.02 14=1.02",
                "3031323334   0=1.56 1=1.5 2=1.48 3=1.05 4=1.05 5=1.04 6=1.04 7=1.01 8=1.01 9=1.01 10=0.97 11=0.97 12=0.97 13=0.97 14=0.97-0.95",
                "3536373839   0=1.54 1=1.47 2=1.46 3=1 4=1 5=0.97 6=0.97 7=0.95 8=0.95 9=0.95 10=0.94 11=0.94 12=0.94 13=0.94 14=0.94-0.93",
                "404142434445474849   0=1.5 1=1.44 2=1.43 3=0.96 4=0.96 5=0.95 6=0.95 7=0.94 8=0.94 9=0.94 10=0.93 11=0.93 12=0.93 13=0.93 14=0.93-0.91",
                "50515253545556575859   0=1.46 1=1.4 2=1.39 3=0.93 4=0.93 5=0.92 6=0.92 7=0.91 8=0.91 9=0.91 10=0.9 11=0.9 12=0.9 13=0.9 14=0.9-0.86",
                "0=1.43 1=1.36 2=1.35 3=0.91 4=0.91 5=0.9 6=0.9 7=0.89 8=0.89 9=0.89 10=0.88 11=0.88 12=0.88 13=0.88 14=0.88-0.83"
    };
    public static String[] cities = {
            "Пенза                                    1.32",
            "Заречный                              1.16",
            "Кузнецк                                 1.0",
            "Прочие города                     0.76"};

    public static String[] months = {
            "3 месяца                0.5",
            "4 месяца                0.6",
            "5 месяцев              0.65",
            "6 месяцев              0.7",
            "7 месяцев              0.8",
            "8 месяцев              0.9",
            "9 месяцев              0.95",
            "10-12 месяцев      1"};

    public static String[] kbmArray = {
            "Страхование впервые (класс 3, кбм1)",
            "1 год без аварий (класс 4, кбм 0.95)",
            "2 года без аварий (класс 5, кбм 0.9)",
            "3 года без аварий (класс 6, кбм 0.85)",
            "4 года без аварий (класс 7, кбм 0.8)",
            "5 лет без аварий (класс 8, кбм 0.75)",
            "6 лет без аварий (класс 9, кбм 0.7)",
            "7 лет без аварий (класс 10, кбм 0.65)",
            "8 лет без аварий (класс 11, кбм 0.6)",
            "9 лет без аварий (класс 12, кбм 0.55)",
            "10 лет без аварий (класс 13, кбм 0.5)",
            "класс М, кбм 2.45",
            "класс 0, кбм 2.3",
            "класс 1, кбм 1.55",
            "класс 2, кбм 1.4"};

    public static String[] drivers = {
            "Договор ОСАГО имеет ограничения по водителям             1",
            "Договор ОСАГО не имеет ограничений по водителям        2.32"
    };
}
